# 1. 密集串列　dense list is convinient in some application
# (1) What situation is not sutible?
# (2) if there have n data, please calculate how many data will move in average when input a new data?
'''
Answer:
(1) 密集串列（靜態資料結構）同時加入或刪除多筆資料時，會造成資料大量移動，此情況非常不方便！
(2) 插入任一位置機率都為1/n, 期望值Ｅ＝ 1*(1/n) + 2*(1/n) + ...+ n*(1/n)
								 	 = (1 + 2 + ...+ n)*(1/n)
									 = (n + 1)/2 
'''
# 2. List 8 kinds of linear List(線性串列)
'''
Answer:
1. 計算串列的長度
2. 取出串列中第ｉ項元素加以修正，1<=i<=n
3. 插入一個新元素到第ｉ項，使得原本第ｉ項後，變成i+1,i+2,...n+1項
4. 刪除一個第ｉ項元素，使得原本第ｉ項後，變成i-1,i,...n-1項
5. 從右到左或從左到右讀取串列中各個元素
6. 在第ｉ項存入新值，並取代舊值
7. 複製串列
8. 合併串列
'''
# 3. A(-3:5,-4:2)陣列的起始位址A(-3,4)=100，以列排序(row-major)為主，請問Loc(A(1,1)) = ?
'''
Answer:
Row-major:
	Loc(aij) = @ + (i-l1)*n*d + (j-l2)*d
Column-major:
	Loc(aij) = @ + (i-l1)*d + (j-l2)*m*d

m = 5 - (-3) = 8　column
n = 2 - (-4) = 6  row
A(1,1) = 100 + (1-(-3))*6*1 + (1-4)*1 = 121
'''
# 5. 若A(1,1)在位置2，A(2,3)在位置18，A(3,2)在位置28，求A(4,5)的位置？
'''
Answer:
A(2,3) = 2 + (2-1)*n*d + (3-1)*d = 18 => d(n + 2) = 16
A(3,2) = 2 + (3-1)*n*d + (2-1)*d = 28 => d(2n + 1) = 26
=> n = 6, d = 2
A(4,5) = 2 + (4-1)*6*2 + (5-1)*2 = 46
'''
# 7. 假設陣列A[-1:3,2:4,1:4,-2:1]是以row-major, 起始位址200, 每個陣列空間為5, 請問A[-1,2,1,-2]、A[3,4,4,1]、A[3,2,1,0]的位置?
'''
Answer:
Row-major:
	Loc(A(i1,i2,...,in)) = @ + (i1 - 1)u2u3u4...und
							 + (i2 - 1)u3u4...und
							 + (i3 - 1)u4...und
							 ...
							 + (in-1 - 1)und
							 + (in - 1)d
Column-major:
	Loc(A(i1,i2,...,in)) = @ + (in - 1)un-1un-2...u1d
							 + (in-1 - 1)un-1...u1d
							 ...
							 + (i2 - 1)u1d
							 + (i1 - 1)d

A[-1:3,2:4,1:4,-2:1], u1=4, u2=2, u3=3, u4=3, d=5
A[-1,2,1,-2] = 200 + (-1-(-1))*u2*u3*u4*d + (2-2)*u3*u4*d + (1-1)*u4*d + (-2-(-2))*d
			 = 200
A[3,4,4,1] = 200 + (3-(-1))*2*3*3*5 + (4-2)*3*3*5 + (4-1)*3*5 + (1-(-2))*5
		   = 200 + 360 + 90 + 45 + 15 = 710
A[3,2,1,0]
'''
# 9. 何謂帶狀陣列(Band Matrix)? 舉例說明
'''
Answer:
Band Matrix是一種稀疏陣列Sparse Matrix，定義為上三角矩陣中，右上方元素皆為0，左下角矩陣中，左右方元素皆為0
for nxn band matrix, numbers of none 0(非零項總數) = 3n - 2,     B(k)
k = 2 + 3 + ... + 3 + j-i + 2
  = 2 + 3i-6 + j-i + 2
  =2i+j-2
'''

# 11. 陣列結構型態通常包含哪些屬性?
'''
Answer:
1. Address 起始位址
2. Dimension 維度
3. Max,min 索引上下限
4. n 陣列元個數
5. type 陣列型態
'''
# 13. 假設我們以FORTRAN語言來宣告浮點陣列A[8][10]，且每個陣列元素占用4個單位的記憶體，
# 如果A[0][0]的起始位址是200，則元素A[5][6]的位址為何?
'''
m = 8, n = 10, d = 4
Loc(A[5][6] = 200 + 5*10*4 + 6*4 = 424 位址為425
'''
# 15. 有